In [1]:
import pandas as pd
import numpy as np

In [19]:
df = pd.read_csv("sleep75.csv", usecols=["age", "educ", "male", "inlf", "sleep", "slpnaps", "totwrk", "selfe", "marr", "gdhlth"])
df

     age  educ  gdhlth  inlf  male  marr  selfe  sleep  slpnaps  totwrk
0     32    12       0     1     1     1      0   3113     3163    3438
1     31    14       1     1     1     0      1   2920     2920    5020
2     44    17       1     1     1     1      1   2670     2760    2815
3     30    12       1     1     0     1      1   3083     3083    3786
4     64    14       1     1     1     1      0   3448     3493    2580
..   ...   ...     ...   ...   ...   ...    ...    ...      ...     ...
701   45    12       1     0     0     1      0   2985     3385    2026
702   34    10       0     0     1     1      0   3520     3535     675
703   37    12       1     0     0     1      0   3510     3510    1851
704   54    17       1     0     0     1      1   2970     3000    1961
705   30    16       1     0     0     1      0   2970     3415    2363

[706 rows x 10 columns]

In [20]:
df.describe()

,age,educ,gdhlth,inlf,male,marr,selfe,sleep,slpnaps,totwrk
count,706.000000,706.000000,706.000000,706.000000,706.000000,706.00000,706.000000,706.000000,706.000000,706.000000
mean,38.815864,12.780453,0.890935,0.753541,0.566572,0.82153,0.131728,3266.355524,3383.083569,2122.920680
std,11.342637,2.784702,0.311942,0.431254,0.495900,0.38318,0.338435,444.413448,499.046930,947.470123
min,23.000000,1.000000,0.000000,0.000000,0.000000,0.00000,0.000000,755.000000,1335.000000,0.000000
25%,29.000000,12.000000,1.000000,1.000000,0.000000,1.00000,0.000000,3015.000000,3105.750000,1553.500000
50%,36.000000,12.000000,1.000000,1.000000,1.000000,1.00000,0.000000,3270.500000,3369.000000,2288.000000
75%,48.000000,16.000000,1.000000,1.000000,1.000000,1.00000,0.000000,3532.250000,3655.000000,2691.750000
max,65.000000,17.000000,1.000000,1.000000,1.000000,1.00000,1.000000,4695.000000,6110.000000,6415.000000

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 706 entries, 0 to 705
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   age      706 non-null    int64
 1   educ     706 non-null    int64
 2   gdhlth   706 non-null    int64
 3   inlf     706 non-null    int64
 4   male     706 non-null    int64
 5   marr     706 non-null    int64
 6   selfe    706 non-null    int64
 7   sleep    706 non-null    int64
 8   slpnaps  706 non-null    int64
 9   totwrk   706 non-null    int64
dtypes: int64(10)
memory usage: 55.3 KB

In [22]:
X = df.drop(columns='gdhlth')
y = df["gdhlth"]

In [23]:
X

     age  educ  inlf  male  marr  selfe  sleep  slpnaps  totwrk
0     32    12     1     1     1      0   3113     3163    3438
1     31    14     1     1     0      1   2920     2920    5020
2     44    17     1     1     1      1   2670     2760    2815
3     30    12     1     0     1      1   3083     3083    3786
4     64    14     1     1     1      0   3448     3493    2580
..   ...   ...   ...   ...   ...    ...    ...      ...     ...
701   45    12     0     0     1      0   2985     3385    2026
702   34    10     0     1     1      0   3520     3535     675
703   37    12     0     0     1      0   3510     3510    1851
704   54    17     0     0     1      1   2970     3000    1961
705   30    16     0     0     1      0   2970     3415    2363

[706 rows x 9 columns]

In [24]:
y

0      0
1      1
2      1
3      1
4      1
      ..
701    1
702    0
703    1
704    1
705    1
Name: gdhlth, Length: 706, dtype: int64